{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Convolution1D", "config": {"batch_input_shape": [null, 193, 1], "W_constraint": null, "b_constraint": null, "name": "convolution1d_15", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 64, "input_dtype": "float32", "subsample_length": 1, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_16", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 64, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_10", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "MaxPooling1D", "config": {"stride": 3, "pool_length": 3, "trainable": true, "name": "maxpooling1d_4", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_17", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 128, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_11", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_18", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 128, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_12", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "GlobalAveragePooling1D", "config": {"trainable": true, "name": "globalaveragepooling1d_4"}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}}]}